#!/usr/bin/env python
# coding: utf-8

# <a id='math-om'></a>
# # Методы оптимизации функций
# Данный раздел посвящен изложению некоторых численных методов оптимизации: поиска стационарных точек функции, а также глобальных минимума и максимума функции, которые будут использовать в дальнейшем для решения задач моделирования.

# **Содержание:**
# * [Нахождение стационарной точки функции методом Ньютона](./OM-1-Newton.html#math-om-newton)
# * [Квази-ньютоновские методы поиска стационарной точки функции](./OM-2-QNewton.html#math-om-qnewton)
# * [Метод доверительной области](./OM-3-TR.html#math-om-tr)
# * [Туннельный метод оптимизации функции](./OM-4-Tunneling.html#math-om-tunneling)
