#!/usr/bin/env python
# coding: utf-8

# <a id='math-om'></a>
# # Методы оптимизации функций
# Данный раздел посвящен изложению некоторых численных методов оптимизации: поиска стационарных точек функции, а также глобальных минимума и максимума функции, которые будут использовать в дальнейшем для решения задач моделирования.

# **Содержание:**
# * [Нахождение стационарной точки методом градиентного спуска](./OM-1-GradientDescent.md)
# * [Нахождение стационарной точки методом Ньютона](./OM-2-Newton.md)
# * [Квази-ньютоновские методы поиска стационарной точки функции](./OM-3-QNewton.md)
# * [Метод доверительной области](./OM-4-TR.md)
# * [Туннельный метод оптимизации функции](./OM-5-Tunneling.md)
