#!/usr/bin/env python
# coding: utf-8

# <a id='pvt-td'></a>
# # Основы термодинамики
# Данный раздел предназначен для изложения основ термодинамики с целью получения математических моделей, позволяющих описывать изменения свойств чистых компонентов и смесей с точки зрения основных термодинамических параметров.

# **Содержание:**
# * [Введение в термодинамику](./TD-1-Basics.md)
# * [Термическое равновесие](./TD-2-ThermalEquilibrium.md)
# * [Количество теплоты и работа](./TD-3-Heat-Work.md)
# * [Теплоемкость](./TD-4-HeatCapacity.md)
# * [Энтальпия](./TD-5-Enthalpy.md)
# * [Энтропия](./TD-6-Entropy.md)
# * [Химический потенциал](./TD-7-ChemicalPotential.md)
# * [Энергия Гельмгольца. Энергия Гиббса](./TD-8-Helmholtz-Gibbs.md)
# * [Интенсивные и экстенсивные параметры](./TD-9-Observables.md)
# * [Энергия Гиббса многокомпонентной системы](./TD-10-MixtureGibbsEnergy.md)
# * [Правило фаз Гиббса](./TD-11-GibbsPhaseRule.md)
# * [Уравнение Гиббса-Дюгема](./TD-12-GibbsDuhemEquation.md)
# * [Соотношения Максвелла](./TD-13-MaxwellRelations.md)
# * [Свободная энергия и фазовое равновесие](./TD-14-PhaseEquilibrium.md)
# * [Летучесть](./TD-15-Fugacity.md)
